# Notes
# When choosing between using `cask` or `mas`
# Consider whether you'd like update management through the
# App Store or Homebrew, the App Store will likely receive updates sooner.



# Kegs

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"



# App Stores

## MacOS App Store
brew "mas"



# Core Languages

brew "python"
brew "ruby"
brew "node"



# Core CLI

## Reads lines from stdin
brew "readline"

## Fuzzy Finder
brew "fzf"

## Grep-like
brew "ripgrep"

## Links dotfiles
brew "stow"

## Find files based on pattern
brew "fd" 

## Finds pid of process name
brew "pidof"

## Parses YAML
brew "yq"

## Parses JSON
brew "jq"

## Switches envrionment variables based on directory
brew "direnv"



# Ruby Env

## Manage Ruby Versions
brew "rbenv"
brew "rbenv-bundler"
brew "rbenv-default-gems"



# Fonts

## Font for code
cask "font-iosevka"



# Version Control

## Git CLI
brew "git"

## Git GUI
cask "fork"



# Reading

## Ebook Reader
# cask "kindle"

## RSS Reader
# cask "winds"

## Ebook Reader and DRM breaker
# cask "calibre"

## Programming Documentation for Libraries
cask "dash"



# Writing

## Neutralizes gender in writing
brew "alexjs"

## Lints writing for improvements
brew "write-good"

## Grades writing for improvements
# cask "grammarly"

## Document Repository and Notebook
cask "notion"

## Zenmode writing app
# mas "iA Writer", id: 775737590

## Notes and Summaries of potential work
# cask "agenda"
# mas "Agenda.", id: 1287445660 



# Containers

## Docker CLI
brew "docker"

## Docker GUI
cask "docker"

## Docker container management GUI
cask "kitematic"



# Network

## Retrieves files over network
brew "wget"

## Visualizes network traffic
# cask "little-snitch"

## Camera and Mic Privacy Monitoring
# cask "micro-snitch"

## Create mock API servers
cask "mockoon"

## HTTP Client
# cask "paw"
cask "postman"
# cask "insomnia"

## VPN Client
cask "nordvpn"
# mas "NordVPN IKE", id: 1116599239

## FTP Client
# cask "yummy-ftp"



# Terminal

## Terminal Client
cask "hyper"
cask "iterm2"

## Terminal Shell
brew "fish"

## Terminal Theme
brew "starship"

## Terminal Sessions
brew "tmux"
# brew "hivemind"
# brew "overmind"

## Combines terminal and system clipboard
brew "reattach-to-user-namespace"

## F Sharp Runtime
# brew "mono"
cask "dotnet-sdk"


# Text Editors and IDEs

brew "vim"
brew "neovim"
# cask "vimr"
# cask "atom"
cask "macvim"
cask "visual-studio-code"
cask "sublime-text"
# mas "Xcode", id: 497799835

# Install Emacs
# TBD which emacs to install
# https://sourabhbajaj.com/mac-setup/Emacs/
# https://github.com/railwaycat/homebrew-emacsmacport
# https://github.com/d12frosted/homebrew-emacs-plus



# Web Browsers

cask "firefox"
cask "google-chrome"
# cask "min"



# App Management

## Automatically quites apps after idle period
# cask "quitter"

## Removes all app artifacts when uninstalling
# cask "appcleaner"



# Window Management

## Tiling Windows
cask "amethyst"

## Hiding Windows
# cask "hocus-focus"



# Virtualization

# cask "vagrant"
# cask "vmware-fusion"
# cask "virtualbox"
# cask "virtualbox-extension-pack"



# Media Players

## Video Players
# cask "mpv"
# cask "vlc"
# cask "elmedia-player"

## Music Players
cask "spotify"



# Torrents

## Torrent Client
# cask "folx"

## Torrent Client with Streaming
# cask "webtorrent"



# Databases

## Database Clients
cask "postico"
cask "tableplus"



# Design

## UI
cask "figma"
cask "sketch"
# mas "Gravit Designer", id: 1207744923

## UX
# cask "principle"

## Sketch Plugin Manager
# cask "craftmanager"

## Handoff Tools
# cask "zeplin"
# cask "avocode"



# Messaging

## Chat
# cask "discord"
# cask "mattermost"
# cask "rocket-chat"

### apps through cask or mas
### mas has auto updates

cask "slack"
# mas "Slack", id: 803453959

# cask "textual"
# mas "Textual 7", id: 1262957439

## Email
# cask "spark"
# mas "Spark Email", id: 1176895641



# Storage

## File Storage and Syncing
cask "dropbox"



# Gaming

# cask "steam"



# Utilities

## Manages launchctl services
# cask "lunchy"

## Turn off notifications when screen sharing
cask "muzzle"

## Manage menu bar apps
cask "bartender"

## Keyboard customizatons
cask "karabiner-elements"

## Mouse and Trackpad
cask "middleclick"

## Keep computer from falling asleep
cask "keepingyouawake"

## Display info about computer
cask "mactracker"
# mas "Mactracker", id: 430255202



# Audio Production

## DAW
# cask "ableton-live-suite"
# mas "GarageBand", id: 682658836

## Audio Interface Controls
# cask "focusrite-control"

## Audio Routing
# cask "loopback"



# Package Managers

## Haskell
# brew "cabal-install"
# brew "haskell-stack"

## Node
brew "yarn"



# Password Management

brew "1password-cli"
cask "1password"
# mas "1Password 7", id: 1333542190



# Productivity

## Time Tracking
cask "clockify"

## Pomodoro Timer
mas "Focus Time Manager", id: 777233759

## Todo Lists
mas "Things 3", id: 904280696

## Mind Mapping
mas "MindNode 6", id: 1289197285

## App Launcher and Workflows
cask "alfred"


# Custom Cask - TODO: Create custom cask
# https://github.com/Homebrew/brew/blob/master/docs/Formula-Cookbook.md
# cask "yousician"
# cask "invision-studio"
# cask "webcatalog"
# https://github.com/Homebrew/homebrew-cask/pull/44750/files

# Install Oni V2 editor when released
# cask "oni2"

# Create Install Script for Cabal Mafia

# Create Install Script for Nix

# Create Install Script for YI

# Create Install Script for NPM CLI Apps
# Create Install Script for WAT
# https://github.com/dthree/wat
